---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.LengthPerArea
source: html/12dfd512-72de-a97c-ed3d-78eb1515fc63.htm
---
# Autodesk.Revit.DB.FillPattern.LengthPerArea Property

Gets length of all lines that placed on unit area.

## Syntax (C#)
```csharp
public double LengthPerArea { get; }
```